backend/app/controllers/comments_controller.rb

    def index
        comments = Comment.all
---
SELECT "comments".* FROM "comments"

    def show
        comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]