backend/app/controllers/videos_controller.rb

SELECT "videos".* FROM "videos"
---
    def index
        videos = Video.all

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        video = Video.find_by(id: params[:id])